---
kind: property
id: P:Autodesk.Revit.DB.ImageType.Status
source: html/5f3ddbfe-0d79-a6d4-4170-d9615a764622.htm
---
# Autodesk.Revit.DB.ImageType.Status Property

The status of the image

## Syntax (C#)
```csharp
public ImageTypeStatus Status { get; }
```